api/pkg/stripe/testdata/paid.json

{
  "id": "evt_1Rv1oaFNNvjhkCqzcLKIZYgF",
  "object": "event",
  "api_version": "2025-01-27.acacia",
  "created": 1754942126,
  "data": {
      "object": {
          "id": "in_1Rv1oVFNNvjhkCqzrdVp2JkZ",
          "object": "invoice",
          "account_country": "US",
          "account_name": "Helix",
          "account_tax_ids": null,
          "amount_due": 2000,
          "amount_overpaid": 0,
          "amount_paid": 2000,
          "amount_remaining": 0,
          "amount_shipping": 0,
          "application": null,
          "application_fee_amount": null,
          "attempt_count": 1,
          "attempted": true,
          "auto_advance": false,
          "automatic_tax": {
              "disabled_reason": null,
              "enabled": false,
              "liability": null,
              "provider": null,
              "status": null
          },
          "automatically_finalizes_at": null,
          "billing_reason": "subscription_create",
          "charge": "ch_3Rv1oWFNNvjhkCqz0OaaYgJ8",
          "collection_method": "charge_automatically",
          "created": 1754942124,
          "currency": "usd",
          "custom_fields": null,
          "customer": "cus_SqicesZoU7LrDR",
          "customer_address": null,
          "customer_email": "nessie@helix.ml",
          "customer_name": null,
          "customer_phone": null,
          "customer_shipping": null,
          "customer_tax_exempt": "none",
          "customer_tax_ids": [],
          "default_payment_method": null,
          "default_source": null,
          "default_tax_rates": [],
          "description": null,
          "discount": null,
          "discounts": [],
          "due_date": null,
          "effective_at": 1754942124,
          "ending_balance": 0,
          "footer": null,
          "from_invoice": null,
          "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1P9EUHFNNvjhkCqz/test_YWNjdF8xUDlFVUhGTk52amhrQ3F6LF9TcWpITGR4OVAwaEJZcWVQTTZ2UHN2Z1NwbGFCVWZKLDE0NTQ4MjkyOA0200pqiE06Ai?s=ap",
          "invoice_pdf": "https://pay.stripe.com/invoice/acct_1P9EUHFNNvjhkCqz/test_YWNjdF8xUDlFVUhGTk52amhrQ3F6LF9TcWpITGR4OVAwaEJZcWVQTTZ2UHN2Z1NwbGFCVWZKLDE0NTQ4MjkyOA0200pqiE06Ai/pdf?s=ap",
          "issuer": {
              "type": "self"
          },
          "last_finalization_error": null,
          "latest_revision": null,
          "lines": {
              "object": "list",
              "data": [
                  {
                      "id": "il_1Rv1oVFNNvjhkCqz5oZbSBnw",
                      "object": "line_item",
                      "amount": 2000,
                      "amount_excluding_tax": 2000,
                      "currency": "usd",
                      "description": "1 × Helix Premium (at $20.00 / month)",
                      "discount_amounts": [],
                      "discountable": true,
                      "discounts": [],
                      "invoice": "in_1Rv1oVFNNvjhkCqzrdVp2JkZ",
                      "livemode": false,
                      "metadata": {
                          "user_id": "5fcd6135-fbed-41b7-9a55-e3625d3dea75"
                      },
                      "parent": {
                          "invoice_item_details": null,
                          "subscription_item_details": {
                              "invoice_item": null,
                              "proration": false,
                              "proration_details": {
                                  "credited_items": null
                              },
                              "subscription": "sub_1Rv1oVFNNvjhkCqzI3vgc41P",
                              "subscription_item": "si_SqjHcKJTXBnRL6"
                          },
                          "type": "subscription_item_details"
                      },
                      "period": {
                          "end": 1757620523,
                          "start": 1754942123
                      },
                      "plan": {
                          "id": "price_1Rv198FNNvjhkCqzaaibIbx2",
                          "object": "plan",
                          "active": true,
                          "aggregate_usage": null,
                          "amount": 2000,
                          "amount_decimal": "2000",
                          "billing_scheme": "per_unit",
                          "created": 1754939558,
                          "currency": "usd",
                          "interval": "month",
                          "interval_count": 1,
                          "livemode": false,
                          "metadata": {},
                          "meter": null,
                          "nickname": null,
                          "product": "prod_Sqia5TdP4XGk1x",
                          "tiers_mode": null,
                          "transform_usage": null,
                          "trial_period_days": null,
                          "usage_type": "licensed"
                      },
                      "pretax_credit_amounts": [],
                      "price": {
                          "id": "price_1Rv198FNNvjhkCqzaaibIbx2",
                          "object": "price",
                          "active": true,
                          "billing_scheme": "per_unit",
                          "created": 1754939558,
                          "currency": "usd",
                          "custom_unit_amount": null,
                          "livemode": false,
                          "lookup_key": "helix-subscription",
                          "metadata": {},
                          "nickname": null,
                          "product": "prod_Sqia5TdP4XGk1x",
                          "recurring": {
                              "aggregate_usage": null,
                              "interval": "month",
                              "interval_count": 1,
                              "meter": null,
                              "trial_period_days": null,
                              "usage_type": "licensed"
                          },
                          "tax_behavior": "unspecified",
                          "tiers_mode": null,
                          "transform_quantity": null,
                          "type": "recurring",
                          "unit_amount": 2000,
                          "unit_amount_decimal": "2000"
                      },
                      "pricing": {
                          "price_details": {
                              "price": "price_1Rv198FNNvjhkCqzaaibIbx2",
                              "product": "prod_Sqia5TdP4XGk1x"
                          },
                          "type": "price_details",
                          "unit_amount_decimal": "2000"
                      },
                      "proration": false,
                      "proration_details": {
                          "credited_items": null
                      },
                      "quantity": 1,
                      "subscription": "sub_1Rv1oVFNNvjhkCqzI3vgc41P",
                      "subscription_item": "si_SqjHcKJTXBnRL6",
                      "tax_amounts": [],
                      "tax_rates": [],
                      "taxes": [],
                      "type": "subscription",
                      "unit_amount_excluding_tax": "2000"
                  }
              ],
              "has_more": false,
              "total_count": 1,
              "url": "/v1/invoices/in_1Rv1oVFNNvjhkCqzrdVp2JkZ/lines"
          },
          "livemode": false,
          "metadata": {},
          "next_payment_attempt": null,
          "number": "VH1KMPTR-0002",
          "on_behalf_of": null,
          "paid": true,
          "paid_out_of_band": false,
          "parent": {
              "quote_details": null,
              "subscription_details": {
                  "metadata": {
                      "user_id": "5fcd6135-fbed-41b7-9a55-e3625d3dea75"
                  },
                  "subscription": "sub_1Rv1oVFNNvjhkCqzI3vgc41P"
              },
              "type": "subscription_details"
          },
          "payment_intent": "pi_3Rv1oWFNNvjhkCqz0nD1lxPu",
          "payment_settings": {
              "default_mandate": null,
              "payment_method_options": {
                  "acss_debit": null,
                  "bancontact": null,
                  "card": {
                      "request_three_d_secure": "automatic"
                  },
                  "customer_balance": null,
                  "konbini": null,
                  "sepa_debit": null,
                  "us_bank_account": null
              },
              "payment_method_types": null
          },
          "period_end": 1754942123,
          "period_start": 1754942123,
          "post_payment_credit_notes_amount": 0,
          "pre_payment_credit_notes_amount": 0,
          "quote": null,
          "receipt_number": null,
          "rendering": null,
          "shipping_cost": null,
          "shipping_details": null,
          "starting_balance": 0,
          "statement_descriptor": null,
          "status": "paid",
          "status_transitions": {
              "finalized_at": 1754942124,
              "marked_uncollectible_at": null,
              "paid_at": 1754942126,
              "voided_at": null
          },
          "subscription": "sub_1Rv1oVFNNvjhkCqzI3vgc41P",
          "subscription_details": {
              "metadata": {
                  "user_id": "5fcd6135-fbed-41b7-9a55-e3625d3dea75"
              }
          },
          "subtotal": 2000,
          "subtotal_excluding_tax": 2000,
          "tax": null,
          "test_clock": null,
          "total": 2000,
          "total_discount_amounts": [],
          "total_excluding_tax": 2000,
          "total_pretax_credit_amounts": [],
          "total_tax_amounts": [],
          "total_taxes": [],
          "transfer_data": null,
          "webhooks_delivered_at": null
      }
  },
  "livemode": false,
  "pending_webhooks": 2,
  "request": {
      "id": null,
      "idempotency_key": "dad56718-1593-4b60-bbef-039e20ffe6ff"
  },
  "type": "invoice.paid"
}